"""
یک متغیر num1 و num2 تعریف کنید
در مرحله اول مقدار 10 به num1 و مقدار 15 به num2 بدید
به ترتیب عملیات جمع تفریق ضرب و تقسیم اعشاری و تقسیم صحیح و باقی مانده متغیر های num1 با num2 پرینت شود
دقت کنید که در هنگام پرینت کردن به نسبت عملیاتی که انجام میشود به انگلیسی چاپ شود که حاصل جمع nm1 با num2 میشود این نامبر

در مرحله بعدی به ترتیب عملیات مقایسه ایی num1 با num2 چاپ شود
تساوی بودن و عدم تساوی بودن بزرگتر کوچکتر و بزرگتر مساوی و کوچک مساوی
اینجا هم در هنگام چاپ کردن حاصل نتیجه عملیات نوشته شود

در مرحله بعد به متغیر num1 عدد 50 رو اضافه میکنید و چاپ میکنید
و در مرحله بعدی num2 عدد 5 رو کسر میکنید و چاپ میکنید
"""
num1 = 10
num2 = 15
print(num1,"+",num2,"=",num1+num2)
print(num1,"-",num2,"=",num1-num2)
print(num1,"*",num2,"=",num1*num2)
print(num1,"/",num2,"=",num1/num2)
print(num1,"//",num2,"=",num1//num2)
print(num1,"%",num2,"=",num1%num2)
print(num1,"==",num2,"=",num1==num2)
print(num1,"!=",num2,"=",num1!=num2)
print(num1,">",num2,"=",num1>num2)
print(num1,"<",num2,"=",num1<num2)
print(num1,">=",num2,"=",num1>=num2)
print(num1,"<=",num2,"=",num1<=num2)
num1 += 50
print(num1)
num2 -= 5
print(num2)